# 과제1

## 조원들의 DataFrame

In [1]:
import pandas as pd

In [5]:
dict = {'이름': ['이재욱','한도담','변영무','조예빈'],
       '나이':[26,24,23,22],
       '학번':[20143628,20152534,20162990,20171564],
       '전화번호':['01076743718','01021067341','01055594078','01082035466']}

In [3]:
dict

{'이름': ['이재욱', '한도담', '변영무', '조예빈'],
 '나이': [26, 24, 23, 22],
 '학번': [20143628, 20152534, 20162990.20171564],
 '전화번호': ['01076743718', '01021067341', '01055594078', '01082035466']}

In [8]:
coco = pd.DataFrame(dict)

In [10]:
coco

    이름  나이        학번         전화번호
0  이재욱  26  20143628  01076743718
1  한도담  24  20152534  01021067341
2  변영무  23  20162990  01055594078
3  조예빈  22  20171564  01082035466

## '나이'열을 기준으로 오름차순 정렬

In [15]:
coco_sorted = coco.sort_values(by=['나이'])
coco_sorted

    이름  나이        학번         전화번호
3  조예빈  22  20171564  01082035466
2  변영무  23  20162990  01055594078
1  한도담  24  20152534  01021067341
0  이재욱  26  20143628  01076743718

## '나이'열을 기준으로 내림차순 정렬

In [18]:
coco_sorted_descend = coco.sort_values(by=['나이'],ascending=False)
coco_sorted_descend

    이름  나이        학번         전화번호
0  이재욱  26  20143628  01076743718
1  한도담  24  20152534  01021067341
2  변영무  23  20162990  01055594078
3  조예빈  22  20171564  01082035466

## DataFram 데이터 삭제

In [19]:
coco_drop_off=coco.drop('나이',axis=1)
coco_drop_off

    이름        학번         전화번호
0  이재욱  20143628  01076743718
1  한도담  20152534  01021067341
2  변영무  20162990  01055594078
3  조예빈  20171564  01082035466

In [20]:
coco

    이름  나이        학번         전화번호
0  이재욱  26  20143628  01076743718
1  한도담  24  20152534  01021067341
2  변영무  23  20162990  01055594078
3  조예빈  22  20171564  01082035466

## DataFrame 슬라이싱

In [21]:
coco['졸업 연도']=coco['학번'][:4]+40000
coco

    이름  나이        학번         전화번호     졸업 연도
0  이재욱  26  20143628  01076743718  20183628
1  한도담  24  20152534  01021067341  20192534
2  변영무  23  20162990  01055594078  20202990
3  조예빈  22  20171564  01082035466  20211564

In [23]:
coco['졸업 연도']=coco['졸업 연도'][:4]
coco

    이름  나이        학번         전화번호     졸업 연도
0  이재욱  26  20143628  01076743718  20183628
1  한도담  24  20152534  01021067341  20192534
2  변영무  23  20162990  01055594078  20202990
3  조예빈  22  20171564  01082035466  20211564